Config/Reports/НакопительнаяВедомостьПоПриходуПродуктовПитания0504037.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>НакопительнаяВедомостьПоПриходуПродуктовПитания0504037</Name>
			<Comment>Накопительная ведомость по приходу продуктов питания (ф. 0504037)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьНастроек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПечать</Name>
					<Comment>Организация для печати в шапке отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Составил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоОтПоставщиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВнутренниеОбороты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПечать</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/МестаХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МестаХранения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Reports/НакопительнаяВедомостьПоПриходуПродуктовПитания0504037/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураБыстрыеОтборы = Новый Структура("Организация,НачалоПериода,КонецПериода");

	РегламентированныеРегистры.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если НЕ ЗначениеЗаполнено(Отчет.ОрганизацияПечать) Тогда
		Отчет.ОрганизацияПечать = Отчет.Организация;
	КонецЕсли;	

	Для каждого КлючЗначение из СтруктураБыстрыеОтборы цикл
		Значение = Неопределено;
		Если Параметры.Свойство(КлючЗначение.Ключ, Значение) тогда
			Отчет[КлючЗначение.Ключ] = Значение;
		КонецЕсли;	
	КонецЦикла;
	
	Отчет.РежимРасшифровки = Параметры.ПредставлениеВарианта = "Расшифровка";
	
	Если Отчет.РежимРасшифровки и ТипЗнч(Параметры.Расшифровка) = Тип("ОписаниеОбработкиРасшифровкиКомпоновкиДанных") тогда
		Для каждого ЭлементСтруктуры из Параметры.Расшифровка.ПрименяемыеНастройки.Структура цикл
			Если ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") тогда
				Для каждого ЭлементВывода из  ЭлементСтруктуры.ПараметрыВывода.Элементы цикл
					Если ЭлементВывода.Параметр = Новый ПараметрКомпоновкиДанных("МакетОформления") тогда
						ЭлементВывода.Использование = Истина;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьНастроек();
	РассчитатьПоказатели();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ВариантМодифицирован                    = Ложь;
	ПользовательскиеНастройкиМодифицированы = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	Настройки.ДополнительныеСвойства.Вставить("ТекущиеНастройки", Новый ХранилищеЗначения(Отчет.КомпоновщикНастроек.ПолучитьНастройки()));	
	СтандартныеОтчеты.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	РегламентированныеРегистры.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиент.ОбновитьОтборКомпоновщикаНастроекБыстрымиОтборами(Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы, 
			Новый Структура("Организация",Отчет.Организация));

	РегламентированныеРегистрыКлиент.ОтборПравоеЗначениеПриИзмененииОчистка(Новый Структура("Сотрудник,МестоХранения"), Отчет.КомпоновщикНастроек);
		
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьОтборПоОрганизации();
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамически", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПравоеЗначениеПриИзменении(Элемент)
	Если Элементы.Отбор.ТекущиеДанные.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") Тогда
		СписокПолейДляОчистки = Новый Структура("Сотрудник,МестоХранения");	
		РегламентированныеРегистрыКлиент.ОтборПравоеЗначениеПриИзмененииОчистка(СписокПолейДляОчистки, Отчет.КомпоновщикНастроек);
		Отчет.Организация = Элементы.Отбор.ТекущиеДанные.ПравоеЗначение;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Найти("В списке, В группе из списка, Не в списке, Не в группе из списка",Элементы.Отбор.ТекущиеДанные.ВидСравнения) = 0 тогда
		СписокЗависимыхПолей = Новый Структура("Сотрудник,МестоХранения",
									Новый Структура("МастерПоле, Отбор","Организация", Новый Структура("ПолеОтбора,Форма","Владелец","Справочник.Сотрудники")),
									Новый Структура("МастерПоле, Отбор","Организация", Новый Структура("ПолеОтбора,Форма","Владелец","Справочник.МестаХранения")));
		РегламентированныеРегистрыКлиент.ОтборПравоеЗначениеНачалоВыбора(Элемент, СтандартнаяОбработка, Элементы.Отбор.ТекущиеДанные, СписокЗависимыхПолей, Отчет.КомпоновщикНастроек);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ЕСли Элемент.ТекущийЭлемент.Вид = ВидПоляФормы.ПолеВвода тогда
		Элемент.ТекущийЭлемент.РежимВыбораИзСписка = Ложь;
		Если ЗначениеЗаполнено(Отчет.Организация) тогда
			Если Элементы.Отбор.ТекущиеДанные.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КФО") и Элемент.текущийЭлемент.Имя = "ОтборПравоеЗначение" тогда
				Элемент.ТекущийЭлемент.РежимВыбораИзСписка = Истина;
				Элемент.ТекущийЭлемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьДоступныеКФО(Отчет.Организация,Отчет.НачалоПериода));
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	МассивОсновныхДействий = Новый Массив;
	МассивОсновныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);
	СтандартныеОтчетыКлиент.ОбработкаРасшифровкиСанкционирование(ЭтаФорма, Элемент, ДанныеРасшифровки, Расшифровка, ПоказательСчет, МассивОсновныхДействий);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	ОчиститьСообщения();
	СформироватьОтчетСервер();	
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)
	Отчет.ВидимостьНастроек = Не Элементы.ГруппаПанельНастроек.Видимость;
	ВидимостьНастроек();	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНастройки(Команда)
	РегламентированныеРегистрыКлиент.СинхронизироватьОтборПользовательскиеНастройки(ЭтаФорма);
	
	ОткрытьФорму("Обработка.КонструкторПользовательскихНастроек.Форма",
		Новый Структура("КомпоновщикНастроек,Схема",Отчет.КомпоновщикНастроек,СхемаКомпоновкиДанных),
		ЭтотОбъект,,,, Новый ОписаниеОповещения("ПрименитьНовыеНастройки", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период.ДатаНачала = Отчет.НачалоПериода;
    Диалог.Период.ДатаОкончания = Отчет.КонецПериода;
    Диалог.Показать(Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтотОбъект));

	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(Период, ДополнительныеПараметры) Экспорт
    
    Если Период <> Неопределено Тогда
		
		Отчет.НачалоПериода = Период.ДатаНачала;
        Отчет.КонецПериода  = Период.ДатаОкончания;
		
		Модифицированность = Истина;
		
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);

    КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ГРУППЫ РЕГИСТРЫ УЧЕТА

&НаКлиенте
Процедура Подключаемый_Команда(Команда)
	
	РегистрыУчетаКлиент.ОбработчикКомандыРаботыСРегистромУчета(ЭтотОбъект, Команда, "Результат");

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики команд расчета показателей.

&НаКлиенте
Процедура РассчитатьСумму(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличество(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСреднее(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМинимум(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМаксимум(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВсеПоказатели(Команда)
	УстановитьВидимостьПоказателей(Не Элементы.РассчитатьВсеПоказатели.Пометка);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПоказатели(Команда)
	УстановитьВидимостьПоказателей(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПрименитьНовыеНастройки(ОтветФормы, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ОтветФормы) = Тип("КомпоновщикНастроекКомпоновкиДанных") тогда
		РегламентированныеРегистрыКлиент.ОбновитьКомпоновщикНастроек(ЭтаФорма,ОтветФормы);
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоступныеКФО(Организация,Дата)
	Возврат БухгалтерскийУчетПовтИсп.КФОПоУчетнойПолитике(Организация,,Дата);		
КонецФункции

&НаСервере
Функция ОбновитьОтборПоОрганизации()
	Отчет.Организация = СтандартныеОтчеты.УстановитьЗначениеОтбора(Отчет.КомпоновщикНастроек,"Организация");
КонецФункции	

&НаСервере
Процедура СформироватьОтчетСервер() Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", ВыводитьЗаголовок);
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал"   , ВыводитьПодвал);
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(
	ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"),
	ЭтаФорма.УникальныйИдентификатор);
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода", 				Отчет.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода", 				Отчет.КонецПериода);
	ПараметрыОтчета.Вставить("КомпоновщикНастроек", 		Отчет.КомпоновщикНастроек);
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных", 		СхемаКомпоновкиДанных);
	ПараметрыОтчета.Вставить("УникальныйИдентификатор", 	ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОтчета.Вставить("ТолькоОтПоставщиков", 		Отчет.ТолькоОтПоставщиков);
	ПараметрыОтчета.Вставить("УчитыватьВнутренниеОбороты", 	Отчет.УчитыватьВнутренниеОбороты);
	ПараметрыОтчета.Вставить("НеВыводитьНомера", 				Отчет.НеВыводитьНомера);
	
	ПараметрыОтчета.Вставить("ОрганизацияПечать", 	Отчет.ОрганизацияПечать);
	ПараметрыОтчета.Вставить("ПодразделениеПечать", Отчет.ПодразделениеПечать);
	ПараметрыОтчета.Вставить("МОЛ",     		 	Отчет.МОЛ);
	ПараметрыОтчета.Вставить("Составил",		 	Отчет.Составил);
	ПараметрыОтчета.Вставить("Проверил",		 	Отчет.Проверил);
	ПараметрыОтчета.Вставить("ВыводитьЗаголовок",	ВыводитьЗаголовок);
	ПараметрыОтчета.Вставить("ВыводитьПодвал",	 	ВыводитьПодвал);
	
	Параметр103н = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Форма103н");
	Форма103н = Параметр103н <> Неопределено И Параметр103н.Использование И Параметр103н.Значение = Истина;
	ПараметрыОтчета.Вставить("Форма103н",	 	Форма103н);
	
	Отчеты.НакопительнаяВедомостьПоПриходуПродуктовПитания0504037.СформироватьОтчет(ПараметрыОтчета, Результат, ДанныеРасшифровки, ПоказательСчет);
	
	СтандартныеОтчеты.УстановитьКолонтитулыПоУмолчанию(Результат, РеквизитФормыВЗначение("Отчет").Метаданные().Синоним, Строка(ПользователиКлиентСервер.АвторизованныйПользователь()), Отчет.Организация);
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьНастроек()
	Элементы.ГруппаПанельНастроек.Видимость = Отчет.ВидимостьНастроек;
	Элементы.ПанельНастроек.Пометка = Элементы.ГруппаПанельНастроек.Видимость;
КонецПРоцедуры	

#Область РасчетПоказателейВыделенныхЯчеек

// Выполняет расчет и вывод показателей выделенной области ячеек.
// См. обработчик события ОтчетТабличныйДокументПриАктивизацииОбласти.
//
&НаКлиенте
Процедура РассчитатьПоказателиДинамически()
	Перем ТекущаяКоманда;
	
	КомандыПоказателей = КомандыПоказателей();
	Для Каждого Команда Из КомандыПоказателей Цикл 
		Если Элементы[Команда.Ключ].Пометка Тогда 
			ТекущаяКоманда = Команда.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьПоказатели(ТекущаяКоманда);
КонецПроцедуры

// Выполняет расчет и вывод показателей выделенных областей ячеек табличного документа.
//
// Параметры:
//  ТекущаяКоманда - Строка - имя команды расчета показателя, например, "РассчитатьСумму".
//                      Определяет, какой показатель является основным.
//
&НаКлиенте
Процедура РассчитатьПоказатели(ТекущаяКоманда = "РассчитатьСумму")
	// Расчет показателей.
	ПараметрыРасчета = ОбщегоНазначенияБГУКлиент.ПараметрыРасчетаПоказателейЯчеек(Элементы.Результат);
	Если ПараметрыРасчета.РассчитатьНаСервере Тогда 
		РасчетныеПоказатели = РасчетныеПоказателиСервер(ПараметрыРасчета);
	Иначе
		РасчетныеПоказатели = ОбщегоНазначенияБГУКлиентСервер.РасчетныеПоказателиЯчеек(
			Результат, ПараметрыРасчета.ВыделенныеОбласти);
	КонецЕсли;
	
	// Установка значений показателей.
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РасчетныеПоказатели);
	
	// Переключение и форматирование показателей.
	КомандыПоказателей = КомандыПоказателей();
	Для Каждого Команда Из КомандыПоказателей Цикл 
		Элементы[Команда.Ключ].Пометка = Ложь;
		
		ЗначениеПоказателя = РасчетныеПоказатели[Команда.Значение];
		РазрядностьПоказателя = Мин(СтрДлина(Макс(ЗначениеПоказателя, -ЗначениеПоказателя) % 1) - 2, 4);
		
		Элементы[Команда.Значение].ФорматРедактирования = "ЧДЦ=" + РазрядностьПоказателя + "; ЧРГ=' '; ЧН=0";
	КонецЦикла;
	Элементы[ТекущаяКоманда].Пометка = Истина;
	
	// Вывод основного показателя.
	ТекущийПоказатель = КомандыПоказателей[ТекущаяКоманда];
	Показатель = ЭтотОбъект[ТекущийПоказатель];
	Элементы.Показатель.ФорматРедактирования = Элементы[ТекущийПоказатель].ФорматРедактирования;
	Элементы.ГруппаВидыПоказателей.Картинка = БиблиотекаКартинок[ТекущийПоказатель];
КонецПроцедуры

// Рассчитывает показатели числовых ячеек в табличном документе.
//  см. ОтчетыКлиентСервер.РасчетныеПоказателиЯчеек.
//
&НаСервере
Функция РасчетныеПоказателиСервер(ПараметрыРасчета)
	Возврат ОбщегоНазначенияБГУКлиентСервер.РасчетныеПоказателиЯчеек(Результат, ПараметрыРасчета.ВыделенныеОбласти);
КонецФункции

// Определяет соответствие между командами расчета показателей и показателями.
//
// Возвращаемое значение:
//   Соответствие - Ключ - имя команды, Значение - имя показателя.
//
&НаКлиенте
Функция КомандыПоказателей()
	КомандыПоказателей = Новый Соответствие();
	КомандыПоказателей.Вставить("РассчитатьСумму", "Сумма");
	КомандыПоказателей.Вставить("РассчитатьКоличество", "Количество");
	КомандыПоказателей.Вставить("РассчитатьСреднее", "Среднее");
	КомандыПоказателей.Вставить("РассчитатьМинимум", "Минимум");
	КомандыПоказателей.Вставить("РассчитатьМаксимум", "Максимум");
	
	Возврат КомандыПоказателей;
КонецФункции

// Управляет признаком видимости панели расчетных показателей.
//
// Параметры:
//  Видимость - Булево - Признак включения / выключения видимости панели показателей.
//              См. также Синтакс-помощник: ГруппаФормы.Видимость.
//
&НаКлиенте
Процедура УстановитьВидимостьПоказателей(Видимость)
	Элементы.ОбластьПоказателей.Видимость = Видимость;
	Элементы.РассчитатьВсеПоказатели.Пометка = Видимость;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
